jardelufc/STM32-Watch/Src/main.c
	else if(dayweek ==4){
		SSD1306_Puts("Thursday", &Font_7x10,1);
	}

	else if(dayweek ==5){
		SSD1306_Puts("Friday", &Font_7x10,1);
	}

	else if(dayweek ==6){
		SSD1306_Puts("Saturday", &Font_7x10,1);
	}

	else if(dayweek ==7){
		SSD1306_Puts("Sunday", &Font_7x10,1);
	}

	SSD1306_UpdateScreen();
}
void display_hour (void)
{

	SSD1306_GotoXY(0,25);
	SSD1306_Puts(time,&Font_7x10,1);
	SSD1306_UpdateScreen();
}

void display_date (void)
{

	SSD1306_GotoXY(0,25);
	SSD1306_Puts(date,&Font_7x10,1);
	SSD1306_UpdateScreen();
}
void display_week (void)
{

	SSD1306_GotoXY(0,25);
	if(dayweek ==1){

		SSD1306_Puts("Monday", &Font_7x10,1);
	}

	else if(dayweek ==2){
		SSD1306_Puts("Tuesday", &Font_7x10,1);
	}

	else if(dayweek ==3){
		SSD1306_Puts("Wednesday", &Font_7x10,1);
	}

	else if(dayweek ==4){
		SSD1306_Puts("Thursday", &Font_7x10,1);
	}

	else if(dayweek ==5){
		SSD1306_Puts("Friday", &Font_7x10,1);
	}

	else if(dayweek ==6){
		SSD1306_Puts("Saturday", &Font_7x10,1);
	}

	else if(dayweek ==7){
		SSD1306_Puts("Sunday", &Font_7x10,1);
	}
	SSD1306_UpdateScreen();
}
int maior(int x,int y){
	if(x>=y){
		return x-y;
	}
	else return y-x;

}






void to_do_on_alarm (void)
{
	SSD1306_GotoXY(0,0);
	SSD1306_Puts("ALARM",&Font_7x10,1);
	SSD1306_UpdateScreen();
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
	HAL_Delay (200);
	SSD1306_Fill(0);
	SSD1306_UpdateScreen();
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);

}

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 *
 * @retval None
 */
int main(void)
{
	/* USER CODE BEGIN 1 */

	/* USER CODE END 1 */

	/* MCU Configuration----------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* USER CODE BEGIN Init */

	/* USER CODE END Init */

	/* Configure the system clock */
	SystemClock_Config();

	/* USER CODE BEGIN SysInit */

	/* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_I2C1_Init();
	MX_RTC_Init();
	MX_ADC_Init();
	/* USER CODE BEGIN 2 */
	check = SSD1306_Init();
	set_time();
	set_alarm ();
	/* USER CODE END 2 */

	/* Infinite loop */
	/* USER CODE BEGIN WHILE */
	while (1)
	{

		/* USER CODE END WHILE */

		/* USER CODE BEGIN 3 */




		HAL_RTC_GetAlarm(&hrtc, &hAlarm,RTC_ALARM_A, RTC_FORMAT_BIN);
		HAL_RTC_GetTime(&hrtc, &hTime, RTC_FORMAT_BIN);
		HAL_RTC_GetDate(&hrtc, &hDate, RTC_FORMAT_BIN);
		hAlarm.AlarmDateWeekDay=hDate.WeekDay;
		char alan2=1;
		if((hAlarm.AlarmTime.Hours == hTime.Hours)&&(hAlarm.AlarmTime.Minutes==hTime.Minutes)&&(hTime.Seconds==0) )
		{
			while(alan2){
				SSD1306_Fill(SSD1306_COLOR_BLACK);// Tela preta
				SSD1306_UpdateScreen();
				to_do_on_alarm();

				if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)){


					while(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)){
						HAL_Delay(20);

					}
					alan2=0;
				}

			}


		}

		get_time();
		display_time();
		char aux = 0;
		char alan=0;

		if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)){
			aux=1;

			while(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)){
				HAL_Delay(20);

			}
			SSD1306_Fill(SSD1306_COLOR_BLACK);// Tela preta
			SSD1306_UpdateScreen();

			while(aux){ // Setar horas
				//mostrar horas
				get_time();
				display_hour();
				SSD1306_GotoXY(0,15);
				SSD1306_Puts("..",&Font_7x10,1);
				SSD1306_UpdateScreen();
				HAL_RTC_GetTime(&hrtc, &hTime, RTC_FORMAT_BIN);

				if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_1)){

					while(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_1)){
						HAL_Delay(20);
					}


					hTime.Hours ++;
					if(hTime.Hours==24){
						hTime.Hours = 0;
					}

					HAL_RTC_SetTime(&hrtc, &hTime, RTC_FORMAT_BIN);


				}

				if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)){
					while(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)){
						HAL_Delay(20);
					}
					SSD1306_Fill(SSD1306_COLOR_BLACK);// Tela preta
					SSD1306_UpdateScreen();
					while(aux){// Setar minutos
						//mostra horas
						get_time();
						display_hour();
						SSD1306_GotoXY(21,15);
						SSD1306_Puts("..",&Font_7x10,1);

						SSD1306_UpdateScreen();

						HAL_RTC_GetTime(&hrtc, &hTime, RTC_FORMAT_BIN);

						if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_1)){
							while(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_1)){
								HAL_Delay(20);
							}


							hTime.Minutes ++;
							if(hTime.Minutes==60){
								hTime.Minutes = 0;
							}
							HAL_RTC_SetTime(&hrtc, &hTime, RTC_FORMAT_BIN);

						}

						if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)){

							while(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)){
								HAL_Delay(20);
							}
							SSD1306_Fill(SSD1306_COLOR_BLACK);// Tela preta
							SSD1306_UpdateScreen();
							while(aux){//setar dia
								//mostrar data
								get_time();
								display_date();
								SSD1306_GotoXY(0,15);
								SSD1306_Puts("..",&Font_7x10,1);

								SSD1306_UpdateScreen();
								HAL_RTC_GetDate(&hrtc, &hDate, RTC_FORMAT_BIN);

								if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_1)){
									while(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_1)){

									}


									hDate.Date ++;
									if((hDate.Date==32) && ((hDate.Month==1 ) || (hDate.Month==3 ) || (hDate.Month==5 ) || (hDate.Month==7 )|| (hDate.Month==8 )|| (hDate.Month==10 )|| (hDate.Month==12 ))){
										hDate.Date = 1;
									}
									if((hDate.Date==30) &&(hDate.Month==2 ) ){
										hDate.Date = 1;
									}
									if((hDate.Date==31) && ((hDate.Month==4 ) || (hDate.Month==6 ) || (hDate.Month==9 )|| (hDate.Month==11 ))){
										hDate.Date = 1;
									}

									HAL_RTC_SetDate(&hrtc, &hDate, RTC_FORMAT_BIN);

								}
								if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)){
									while(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)){

									}
									SSD1306_Fill(SSD1306_COLOR_BLACK);// Tela preta
									SSD1306_UpdateScreen();
									while(aux){//setar mes
										//mostrar data
										get_time();
										display_date();
										SSD1306_GotoXY(21,15);
										SSD1306_Puts("..",&Font_7x10,1);

										SSD1306_UpdateScreen();

										HAL_RTC_GetDate(&hrtc, &hDate, RTC_FORMAT_BIN);
										uint8_t mes=hDate.Month;

										if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_1)){
											while(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_1)){
												HAL_Delay(20);
											}

											mes ++;
											if(mes==13){
												mes = RTC_MONTH_JANUARY;
											}
											hDate.Month = mes;
											HAL_RTC_SetDate(&hrtc, &hDate, RTC_FORMAT_BIN);


