jardelufc/STM32-Watch/Src/main.c
										}
										if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)){

											while(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)){
												HAL_Delay(20);
											}
											SSD1306_Fill(SSD1306_COLOR_BLACK);// Tela preta
											SSD1306_UpdateScreen();
											while(aux){//setar dia da semana
												//mostrar dia da semana

												get_time();
												display_week();
												HAL_RTC_GetDate(&hrtc, &hDate, RTC_FORMAT_BIN);
												uint8_t aux1 = hDate.WeekDay;
												if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_1)){
													while(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_1)){
														HAL_Delay(20);
													}

													aux1 ++;
													if(aux1==8){
														aux1=1;
													}
													hDate.WeekDay=aux1;
													HAL_RTC_SetDate(&hrtc, &hDate, RTC_FORMAT_BIN);
													SSD1306_Fill(SSD1306_COLOR_BLACK);// Tela preta
													SSD1306_UpdateScreen();

												}
												if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)){

													while(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)){
														HAL_Delay(20);
													}
													SSD1306_Fill(SSD1306_COLOR_BLACK);// Tela preta
													SSD1306_UpdateScreen();
													aux=0;
												}


											}
										}

									}
								}
							}
						}


					}
				}


			}
		}
		if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_1)){
			alan=1;
			while(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_1)){
				HAL_Delay(20);
			}
			SSD1306_Fill(SSD1306_COLOR_BLACK);// Tela preta
			SSD1306_UpdateScreen();
			while(alan){

				get_alarm();
				display_alarm();
				SSD1306_GotoXY(0,15);
				SSD1306_Puts("..",&Font_7x10,1);
				SSD1306_GotoXY(0,8);
				SSD1306_Puts("Set Alarm",&Font_7x10,1);
				SSD1306_UpdateScreen();
				HAL_RTC_GetAlarm(&hrtc, &hAlarm,RTC_ALARM_A, RTC_FORMAT_BIN);
				int alhour = hAlarm.AlarmTime.Hours;
				if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_1)){
					while(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_1)){
						HAL_Delay(20);
					}
					alhour ++;
					if(alhour==24){
						alhour=0;
					}
					hAlarm.AlarmTime.Hours=alhour;
					HAL_RTC_SetAlarm(&hrtc, &hAlarm, RTC_FORMAT_BIN);

				}
				if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)){
					while(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)){
						HAL_Delay(20);
					}
					SSD1306_Fill(SSD1306_COLOR_BLACK);// Tela preta
					SSD1306_UpdateScreen();
					while(alan){
						get_alarm();
						display_alarm();
						SSD1306_GotoXY(21,15);
						SSD1306_Puts("..",&Font_7x10,1);
						SSD1306_GotoXY(0,8);
						SSD1306_Puts("Set Alarm",&Font_7x10,1);
						SSD1306_UpdateScreen();
						HAL_RTC_GetAlarm(&hrtc, &hAlarm,RTC_ALARM_A, RTC_FORMAT_BIN);
						int almin = hAlarm.AlarmTime.Minutes ;

						if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_1)){
							while(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_1)){

							}
							almin ++;
							if(almin==60){
								almin=1;
							}
							hAlarm.AlarmTime.Minutes = almin;
							HAL_RTC_SetAlarm(&hrtc, &hAlarm, RTC_FORMAT_BIN);

						}
						if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)){

							while(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)){

							}
							SSD1306_Fill(SSD1306_COLOR_BLACK);// Tela preta
							SSD1306_UpdateScreen();
							alan=0;
						}

					}

				}

			}
			alan=0;
		}
		HAL_ADC_Start(&hadc);
		int dado =HAL_ADC_GetValue(&hadc);
		HAL_Delay(20);
		HAL_ADC_Start(&hadc);
		int dado2 =HAL_ADC_GetValue(&hadc);
		//intToStr(dado,dadoS,4);
		//intToStr(dado2,dadoS2,4);
		//SSD1306_GotoXY(93,40);
		//SSD1306_Puts(dadoS,&Font_7x10,1);

		//SSD1306_GotoXY(93,50);
		//SSD1306_Puts(dadoS2,&Font_7x10,1);
		//SSD1306_UpdateScreen();
		if(((dado-dado2)>=100)||((dado-dado2)<=-100)){
			SSD1306_GotoXY(93,20);
			SSD1306_Puts("<3",&Font_7x10,1);
			SSD1306_UpdateScreen();
			SSD1306_GotoXY(93,20);
			SSD1306_Puts("  ",&Font_7x10,1);
			SSD1306_UpdateScreen();

		}
		if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_5)){
			while(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_5)){
				HAL_Delay(20);
			}
			SSD1306_Fill(SSD1306_COLOR_BLACK);// Tela preta
			SSD1306_UpdateScreen();
			char alan3=1;
			RTC_TimeTypeDef iTime;

			while(alan3){
				get_time();
				HAL_RTC_GetTime(&hrtc, &iTime, RTC_FORMAT_BIN);

				uint8_t hours1=iTime.Hours;
				uint8_t min1 =iTime.Minutes;
				uint8_t sec1=iTime.Seconds;


				SSD1306_GotoXY(0,15);
				SSD1306_Puts("00:00:00",&Font_7x10,1);
				SSD1306_UpdateScreen();

				if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_1)){
					while(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_1)){
						HAL_Delay(20);
					}
					SSD1306_Fill(SSD1306_COLOR_BLACK);// Tela preta
					SSD1306_UpdateScreen();

					while(alan3){
						get_time();

						HAL_RTC_GetTime(&hrtc, &iTime, RTC_FORMAT_BIN);


						uint8_t hours2=iTime.Hours;
						uint8_t min2 =iTime.Minutes;
						uint8_t sec2=iTime.Seconds;


						int hours = hours2 - hours1;
						int min = min2 - min1;
						int sec = sec2 - sec1;

						intToStr(hours,chr1,2);
						intToStr(min,chr2,2);
						intToStr(sec,chr3,2);
						SSD1306_GotoXY(0,15);
						SSD1306_Puts(chr1,&Font_7x10,1);
						SSD1306_GotoXY(14,15);
						SSD1306_Puts(":",&Font_7x10,1);
						SSD1306_GotoXY(21,15);
						SSD1306_Puts(chr2,&Font_7x10,1);
						SSD1306_GotoXY(35,15);
						SSD1306_Puts(":",&Font_7x10,1);
						SSD1306_GotoXY(42,15);
						SSD1306_Puts(chr3,&Font_7x10,1);
						SSD1306_UpdateScreen();
						if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)){
							while(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)){
								HAL_Delay(20);
							}
							SSD1306_Fill(SSD1306_COLOR_BLACK);// Tela preta
							SSD1306_UpdateScreen();
							alan3=0;
						}


					}

				}
				if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)){
					while(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)){
						HAL_Delay(20);
					}
					SSD1306_Fill(SSD1306_COLOR_BLACK);// Tela preta
					SSD1306_UpdateScreen();
					alan3=0;
				}


			}







		}

	}
	/* USER CODE END 3 */

}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void)
{

	RCC_OscInitTypeDef RCC_OscInitStruct;
	RCC_ClkInitTypeDef RCC_ClkInitStruct;
	RCC_PeriphCLKInitTypeDef PeriphClkInit;

	/**Initializes the CPU, AHB and APB busses clocks
	 */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI|RCC_OSCILLATORTYPE_HSI14
			|RCC_OSCILLATORTYPE_LSI;
	RCC_OscInitStruct.HSIState = RCC_HSI_ON;
	RCC_OscInitStruct.HSI14State = RCC_HSI14_ON;
	RCC_OscInitStruct.HSICalibrationValue = 16;
	RCC_OscInitStruct.HSI14CalibrationValue = 16;
	RCC_OscInitStruct.LSIState = RCC_LSI_ON;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
	{
		_Error_Handler(__FILE__, __LINE__);
	}

